app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`can_send_messages`, `created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `is_admin`, `last_login_at`, `last_login_ip`, `last_request_at`, `login`, `login_count`, `password_salt`, `persistence_token`, `single_access_token`, `updated_at`) VALUES (1, '2014-03-17 18:13:48', '3360b1729efce8584823f4508b7c3ae18caf69fd70418f6a713f861062835773cd136e4d0d36d1f0f35b0ad1227308d1c98a6d833fe69974e9faad5bad913fbe', '2014-03-17 18:13:48', '127.0.0.1', 'rayshuddhashil@gmail.com', 0, NULL, NULL, NULL, '2014-03-17 18:13:48', 'crazy_ray', 1, 'Wo77Yhd7vTwMdJq4u9Au', '9135a4b321c89a1aad5a56943f661534d6fb978afdf7930777358653f9a4a324fcf88ff0a64d6129922e0dc63488d334a2b8eeea927ef8945496739e6950abbf', 'pbckQaex3qkqducQuk52', '2014-03-17 18:13:48')